viv_of9/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    cylinder
    {
        type            nutUBlendedWallFunction;
        value           uniform 0;
    }
    
    top
    {
        type            nutUBlendedWallFunction;
        value           uniform 0;
    }
    
    bottom
    {
        type            nutUBlendedWallFunction;
        value           uniform 0;
    }
    
    sides
    {
        type            symmetry;
    }
 
}


// ************************************************************************* //
